module.exports = {
  "character.selfSummonInstructions": `โปรดป้อนข้อมูลตัวละครของคุณตามรูปแบบดังต่อไปนี้:

%%%! CHARACTER
Name: [ชื่อของคุณ]
Title: [เขา/เธอ/พวกเขา/ฯลฯ]
Description: [คำอธิบายตัวละครของคุณ อย่าลืมรวมชื่อและอาวุธของคุณด้วย]
%%%

จากนั้นเรียกตัวเองโดยพิมพ์ %summon [ชื่อของคุณ]%.`,

/*
%%%! CHARACTER
Name: ปราสาทแห่งแสง
Title: เธอ
Description: ปราสาทแห่งแสง, ซึ่งเป็นพ่อมดหญิงที่มีอำนาจในเวทมนตร์แห่งแสง, คอยค้นหาความรู้และความจริงที่ซ่อนอยู่ในโลกนี้ด้วยไม้เท้ามหัศจรรย์ของเธอ
%%%

%summon ปราสาทแห่งแสง%
*/

  "hello": "สวัสดี.",
  "place.describe": "นี่เป็น{{room}}ที่สวยงาม.",
  "search.fail": "{{actor.name}} ค้นหาใน {{room}} แต่ไม่พบเศษส่วนใดๆ",
  "search.foundItems": "{{actor.name}} ค้นหาใน {{room}}. {{actor.name}} พบไอเท็มที่มีประโยชน์บางอย่างแต่ไม่พบเศษส่วน"
};

